Revit 2027 API
TaskDialog.AllowCancellation Property
 Whether the task dialog can be cancelled if no cancel button is specified.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowCancellation { get; set; }
Public Property AllowCancellation As Boolean
	Get
	Set
public:
property bool AllowCancellation {
	bool get ();
	void set (bool value);
}
member AllowCancellation : bool with get, set
Property Value
Boolean
Remarks
 The default value is true. If there is a cancel button in the task dialog, the it always can be cancelled.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace